-- MySQL dump 10.13  Distrib 5.7.17, for Linux (x86_64)
--
-- Host: localhost    Database: schoolData
-- ------------------------------------------------------
-- Server version	5.7.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `학과현황`
--

DROP TABLE IF EXISTS `학과현황`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `학과현황` (
  `년도` int(11) NOT NULL,
  `단과대학` varchar(10) NOT NULL,
  `학과명` varchar(15) NOT NULL,
  `_5대계열` varchar(5) DEFAULT NULL,
  `학문계열1` varchar(5) DEFAULT NULL,
  `신설연도` varchar(15) DEFAULT NULL,
  `비고` varchar(20) DEFAULT NULL,
  `연번` int(11) NOT NULL AUTO_INCREMENT,
  `입력부서` varchar(45) NOT NULL,
  PRIMARY KEY (`년도`,`학과명`),
  UNIQUE KEY `연번` (`연번`)
) ENGINE=InnoDB AUTO_INCREMENT=863 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `학과현황`
--

LOCK TABLES `학과현황` WRITE;
/*!40000 ALTER TABLE `학과현황` DISABLE KEYS */;
INSERT INTO `학과현황` VALUES (2017,'보건생명대학','간호학과','자연과학','자연','','',847,'admin'),(2017,'공과대학','건설환경도시교통공학부','공학','자연','','',821,'admin'),(2017,'공과대학','건축공학전공 ','공학','자연','','',814,'admin'),(2017,'공과대학','건축학부','공학','자연','','',824,'admin'),(2017,'공과대학','건축학전공','공학','창작','','',815,'admin'),(2017,'인문사회대학','경영통상복지학부','인문사회','인문사회','','',845,'admin'),(2017,'인문사회대학','경영학전공','인문사회','인문사회','','',833,'admin'),(2017,'인문사회대학','국제통상전공','인문사회','인문사회','2010','',835,'admin'),(2017,'인문사회대학','글로벌어문학부','인문사회','인문사회','','',843,'admin'),(2017,'융합기술대학','기계공학전공','공학','자연','','',798,'admin'),(2017,'융합기술대학','기계자동차항공공학부','공학','자연','','',804,'admin'),(2017,'공과대학','나노고분자공학전공','공학','자연','','',811,'admin'),(2017,'공과대학','도시교통공학전공','공학','자연','','',808,'admin'),(2017,'공과대학','디자인학부','예체능','창작','','',825,'admin'),(2017,'보건생명대학','물리치료학과','자연과학','자연','','',851,'admin'),(2017,'인문사회대학','비즈니스영어전공','인문사회','인문사회','','',828,'admin'),(2017,'인문사회대학','사회복지학전공','인문사회','인문사회','','',836,'admin'),(2017,'공과대학','산업경영공학전공','공학','자연','','',812,'admin'),(2017,'공과대학','산업경영안전공학부','공학','자연','','',823,'admin'),(2017,'공과대학','산업디자인전공','예체능','창작','','',816,'admin'),(2017,'보건생명대학','생명공학전공','공학','자연','','',850,'admin'),(2017,'공과대학','소프트웨어학전공','공학','자연','','',819,'admin'),(2017,'인문사회대학','스포츠건강관리학전공','예체능','인문사회','','',838,'admin'),(2017,'인문사회대학','스포츠산업학전공','예체능','인문사회','2011','',839,'admin'),(2017,'인문사회대학','스포츠학부','예체능','인문사회','','',846,'admin'),(2017,'보건생명대학','식품공학전공','자연과학','자연','','',848,'admin'),(2017,'보건생명대학','식품생명학부','자연과학','자연','','',854,'admin'),(2017,'보건생명대학','식품영양학전공','자연과학','자연','2011','',849,'admin'),(2017,'공과대학','신소재공학전공','공학','자연','','',810,'admin'),(2017,'공과대학','안전공학전공','공학','자연','','',813,'admin'),(2017,'인문사회대학','영어영문학전공','인문사회','인문사회','','',827,'admin'),(2017,'인문사회대학','유아교육학과','인문사회','인문사회','','',842,'admin'),(2017,'보건생명대학','유아특수교육학과','인문사회','인문사회','2012','',853,'admin'),(2017,'인문사회대학','융합경영전공','인문사회','인문사회','','',834,'admin'),(2017,'인문사회대학','음악학과','예체능','창작','','',837,'admin'),(2017,'보건생명대학','응급구조학과','자연과학','자연','','',852,'admin'),(2017,'공과대학','의료IT공학전공','공학','자연','2010','',820,'admin'),(2017,'융합기술대학','자동차공학전공','공학','자연','','',799,'admin'),(2017,'융합기술대학','전기공학전공','공학','자연','','',801,'admin'),(2017,'융합기술대학','전기전자로봇통신공학부','공학','자연','','',805,'admin'),(2017,'융합기술대학','전자공학전공','공학','자연','','',802,'admin'),(2017,'융합기술대학','정보통신∙로봇공학전공','공학','자연','','',803,'admin'),(2017,'인문사회대학','중국어전공','인문사회','인문사회','','',829,'admin'),(2017,'철도대학','철도경영물류컴퓨터학부','인문사회','인문사회','','',861,'admin'),(2017,'철도대학','철도경영물류학전공','인문사회','인문사회','2012','',855,'admin'),(2017,'철도대학','철도공학부','공학','자연','','',862,'admin'),(2017,'철도대학','철도운전시스템전공','공학','자연','2012','',857,'admin'),(2017,'철도대학','철도인프라시스템공학전공','공학','자연','2012','',859,'admin'),(2017,'철도대학','철도전기전자전공','공학','자연','2012','',860,'admin'),(2017,'철도대학','철도차량시스템전공','공학','자연','2012','',858,'admin'),(2017,'공과대학','커뮤니케이션디자인전공','예체능','창작','2011','',817,'admin'),(2017,'공과대학','컴퓨터공학전공','공학','자연','','',818,'admin'),(2017,'철도대학','컴퓨터정보공학전공','공학','자연','','',856,'admin'),(2017,'공과대학','컴퓨터정보기술공학부','공학','자연','','',826,'admin'),(2017,'공과대학','토목공학전공','공학','자연','','',806,'admin'),(2017,'인문사회대학','한국어문학전공','인문사회','창작','','',830,'admin'),(2017,'융합기술대학','항공기계설계전공','공학','자연','','',800,'admin'),(2017,'인문사회대학','항공서비스학과','인문사회','인문사회','2011','',840,'admin'),(2017,'인문사회대학','항공운항학과','인문사회','인문사회','2011','',841,'admin'),(2017,'인문사회대학','행정정보학전공','인문사회','인문사회','','',832,'admin'),(2017,'인문사회대학','행정학부','인문사회','인문사회','','',844,'admin'),(2017,'인문사회대학','행정학전공','인문사회','인문사회','','',831,'admin'),(2017,'공과대학','화공생물공학전공','공학','자연','','',809,'admin'),(2017,'공과대학','화공신소재고분자공학부','공학','자연','','',822,'admin'),(2017,'공과대학','환경공학전공','공학','자연','','',807,'admin');
/*!40000 ALTER TABLE `학과현황` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-02-27 11:55:02
