-- MySQL dump 10.13  Distrib 5.7.17, for Linux (x86_64)
--
-- Host: localhost    Database: schoolData
-- ------------------------------------------------------
-- Server version	5.7.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `발전기금조성액상세자료`
--

DROP TABLE IF EXISTS `발전기금조성액상세자료`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `발전기금조성액상세자료` (
  `연번` int(11) NOT NULL AUTO_INCREMENT,
  `년도` int(11) DEFAULT NULL,
  `학과명` varchar(15) CHARACTER SET utf8 NOT NULL,
  `구분` char(10) CHARACTER SET utf8 NOT NULL,
  `금액` int(11) NOT NULL,
  `비고` varchar(45) COLLATE utf8_danish_ci DEFAULT NULL,
  `입력부서` varchar(45) COLLATE utf8_danish_ci DEFAULT NULL,
  PRIMARY KEY (`연번`)
) ENGINE=InnoDB AUTO_INCREMENT=2510 DEFAULT CHARSET=utf8 COLLATE=utf8_danish_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `발전기금조성액상세자료`
--

LOCK TABLES `발전기금조성액상세자료` WRITE;
/*!40000 ALTER TABLE `발전기금조성액상세자료` DISABLE KEYS */;
INSERT INTO `발전기금조성액상세자료` VALUES (2345,2017,'건축학전공','교원',360000,'','admin'),(2346,2017,'전기공학전공','교원',30000,'','admin'),(2347,2017,'전기공학전공','교원',180000,'','admin'),(2348,2017,'전기공학전공','교원',180000,'','admin'),(2349,2017,'전기공학전공','교원',180000,'','admin'),(2350,2017,'전기공학전공','교원',180000,'','admin'),(2351,2017,'전기공학전공','교원',180000,'','admin'),(2352,2017,'전기공학전공','조교',108000,'','admin'),(2353,2017,'전기공학전공','조교',108000,'','admin'),(2354,2017,'경영학전공','조교',216000,'','admin'),(2355,2017,'소프트웨어학전공','교원',1200000,'','admin'),(2356,2017,'안전공학전공','교원',240000,'','admin'),(2357,2017,'식품공학전공','교원',1080000,'','admin'),(2358,2017,'기계공학전공','교원',860000,'','admin'),(2359,2017,'영어영문학전공','교원',100000,'','admin'),(2360,2017,'스포츠건강관리학전공','교원',330000,'','admin'),(2361,2017,'항공·기계설계전공','교원',180000,'','admin'),(2362,2017,'항공·기계설계전공','교원',180000,'','admin'),(2363,2017,'항공·기계설계전공','교원',180000,'','admin'),(2364,2017,'항공·기계설계전공','교원',180000,'','admin'),(2365,2017,'항공·기계설계전공','교원',180000,'','admin'),(2366,2017,'항공·기계설계전공','교원',180000,'','admin'),(2367,2017,'항공·기계설계전공','교원',180000,'','admin'),(2368,2017,'건축공학전공','교원',360000,'','admin'),(2369,2017,'스포츠산업학전공','교원',240000,'','admin'),(2370,2017,'소프트웨어학전공','교원',240000,'','admin'),(2371,2017,'건축공학전공','교원',360000,'','admin'),(2372,2017,'건축공학전공','교원',360000,'','admin'),(2373,2017,'건축공학전공','교원',360000,'','admin'),(2374,2017,'건축공학전공','교원',360000,'','admin'),(2375,2017,'전기공학전공','동문',180000,'','admin'),(2376,2017,'토목공학전공','교원',360000,'','admin'),(2377,2017,'의료IT공학전공','교원',720000,'','admin'),(2378,2017,'유아특수교육학과','교원',72000,'','admin'),(2379,2017,'항공운항학과','교원',360000,'','admin'),(2380,2017,'행정정보학전공','교원',330000,'','admin'),(2381,2017,'식품공학전공','교원',600000,'','admin'),(2382,2017,'기계공학전공','교원',36000,'','admin'),(2383,2017,'컴퓨터공학전공','직원',120000,'','admin'),(2384,2017,'유아특수교육학과','교원',252000,'','admin'),(2385,2017,'행정학전공','직원',125000,'','admin'),(2386,2017,'항공서비스학과','교원',150000,'','admin'),(2387,2017,'물리치료학과','교원',40000,'','admin'),(2388,2017,'물리치료학과','조교',60000,'','admin'),(2389,2017,'전자공학전공','조교',108000,'','admin'),(2390,2017,'유아교육학과','조교',108000,'','admin'),(2391,2017,'스포츠건강관리학전공','교원',330000,'','admin'),(2392,2017,'건축학전공','교원',360000,'','admin'),(2393,2017,'사회복지학전공','교원',200000,'','admin'),(2394,2017,'간호학과','교원',708000,'','admin'),(2395,2017,'커뮤니케이션디자인전공','교원',310000,'','admin'),(2396,2017,'비즈니스영어전공','교원',360000,'','admin'),(2397,2017,'응급구조학과','교원',200000,'','admin'),(2398,2017,'영어영문학전공','직원',20000,'','admin'),(2399,2017,'산업디자인전공','교원',600000,'','admin'),(2400,2017,'소프트웨어학전공','외부',18000,'','admin'),(2401,2017,'커뮤니케이션디자인전공','교원',390000,'','admin'),(2402,2017,'식품영양학전공','교원',180000,'','admin'),(2403,2017,'소프트웨어학전공','교원',360000,'','admin'),(2404,2017,'건축학전공','교원',2360000,'','admin'),(2405,2017,'유아특수교육학과','교원',540000,'','admin'),(2406,2017,'건축학전공','교원',360000,'','admin'),(2407,2017,'유아특수교육학과','교원',144000,'','admin'),(2408,2017,'커뮤니케이션디자인전공','교원',390000,'','admin'),(2409,2017,'건축학전공','조교',36000,'','admin'),(2410,2017,'스포츠건강관리학전공','교원',330000,'','admin'),(2411,2017,'신소재공학전공','조교',108000,'','admin'),(2412,2017,'건축학전공','교원',360000,'','admin'),(2413,2017,'스포츠산업학전공','교원',240000,'','admin'),(2414,2017,'간호학과','교원',360000,'','admin'),(2415,2017,'화공생물공학전공','교원',100000,'','admin'),(2416,2017,'자동차공학전공','외부',500000,'','admin'),(2417,2017,'안전공학전공','동문',210000,'','admin'),(2418,2017,'행정학전공','동문',130000,'','admin'),(2419,2017,'간호학과','직원',70000,'','admin'),(2420,2017,'건축공학전공','교원',120000,'','admin'),(2421,2017,'자동차공학전공','조교',20000,'','admin'),(2422,2017,'자동차공학전공','교원',50000,'','admin'),(2423,2017,'컴퓨터공학전공','교원',2000000,'','admin'),(2424,2017,'경영학전공','교원',800000,'','admin'),(2425,2017,'경영학전공','교원',800000,'','admin'),(2426,2017,'경영학전공','교원',800000,'','admin'),(2427,2017,'경영학전공','교원',800000,'','admin'),(2428,2017,'경영학전공','교원',800000,'','admin'),(2429,2017,'행정학전공','직원',120000,'','admin'),(2430,2017,'경영학전공','교원',800000,'','admin'),(2431,2017,'경영학전공','교원',800000,'','admin'),(2432,2017,'스포츠산업학전공','교원',600000,'','admin'),(2433,2017,'융합경영전공','동문',500000,'','admin'),(2434,2017,'나노고분자공학전공','동문',300000,'','admin'),(2435,2017,'환경공학전공','외부',2000000,'','admin'),(2436,2017,'간호학과','동문',300000,'','admin'),(2437,2017,'건축학전공','외부',3000000,'','admin'),(2438,2017,'스포츠산업학전공','교원',400000,'','admin'),(2439,2017,'항공운항학과','학부모',320000,'','admin'),(2440,2017,'항공운항학과','학부모',120000,'','admin'),(2441,2017,'항공운항학과','학생',40000,'','admin'),(2442,2017,'항공운항학과','학부모',160000,'','admin'),(2443,2017,'환경공학전공','교원',2500000,'','admin'),(2444,2017,'항공운항학과','학부모',280000,'','admin'),(2445,2017,'항공운항학과','학부모',320000,'','admin'),(2446,2017,'항공운항학과','학부모',160000,'','admin'),(2447,2017,'항공운항학과','학부모',240000,'','admin'),(2448,2017,'항공운항학과','학부모',140000,'','admin'),(2449,2017,'항공운항학과','학부모',320000,'','admin'),(2450,2017,'항공운항학과','학부모',360000,'','admin'),(2451,2017,'항공운항학과','학부모',2000000,'','admin'),(2452,2017,'항공운항학과','학부모',320000,'','admin'),(2453,2017,'항공운항학과','학부모',120000,'','admin'),(2454,2017,'항공운항학과','학부모',320000,'','admin'),(2455,2017,'항공운항학과','학부모',120000,'','admin'),(2456,2017,'항공운항학과','학부모',400000,'','admin'),(2457,2017,'항공운항학과','학부모',320000,'','admin'),(2458,2017,'항공운항학과','학부모',320000,'','admin'),(2459,2017,'화공생물공학전공','교원',100000,'','admin'),(2460,2017,'기계공학전공','외부(후원의 집)',1000000,'','admin'),(2461,2017,'신소재공학전공','교원',80000,'','admin'),(2462,2017,'한국어문학전공','교원',120000,'','admin'),(2463,2017,'식품영양학전공','교원',180000,'','admin'),(2464,2017,'소프트웨어학전공','교원',220000,'','admin'),(2465,2017,'자동차공학전공','교원',50000,'','admin'),(2466,2017,'항공운항학과','외부',1000000,'','admin'),(2467,2017,'스포츠산업학전공','교원',20000,'','admin'),(2468,2017,'한국어문학전공','교원',210000,'','admin'),(2469,2017,'철도경영·물류학전공','교원',120000,'','admin'),(2470,2017,'전기공학전공','교원',45000,'','admin'),(2471,2017,'스포츠산업학전공','교원',520000,'','admin'),(2472,2017,'자동차공학전공','교원',50000,'','admin'),(2473,2017,'스포츠건강관리학전공','교원',60000,'','admin'),(2474,2017,'항공운항학과','학생',18000,'','admin'),(2475,2017,'자동차공학전공','조교',70000,'','admin'),(2476,2017,'기계공학전공','교원',40000,'','admin'),(2477,2017,'전기공학전공','교원',45000,'','admin'),(2478,2017,'안전공학전공','교원',1000000,'','admin'),(2479,2017,'유아교육학과','교원',1000000,'','admin'),(2480,2017,'간호학과','교원',80000,'','admin'),(2481,2017,'자동차공학전공','교원',70000,'','admin'),(2482,2017,'산업경영공학전공','외부',1000000,'','admin'),(2483,2017,'자동차공학전공','교원',120000,'','admin'),(2484,2017,'자동차공학전공','교원',120000,'','admin'),(2485,2017,'자동차공학전공','교원',50000,'','admin'),(2486,2017,'스포츠산업학전공','외부',300000,'','admin'),(2487,2017,'항공·기계설계전공','동문',12000,'','admin'),(2488,2017,'스포츠산업학전공','학생',200000,'','admin'),(2489,2017,'스포츠산업학전공','학생',200000,'','admin'),(2490,2017,'스포츠산업학전공','학생',200000,'','admin'),(2491,2017,'스포츠산업학전공','학생',200000,'','admin'),(2492,2017,'스포츠산업학전공','학생',200000,'','admin'),(2493,2017,'항공·기계설계전공','교원',80000,'','admin'),(2494,2017,'나노고분자공학전공','외부',100000,'','admin'),(2495,2017,'화공생물공학전공','외부',100000,'','admin'),(2496,2017,'사회복지학전공','교원',1000000,'','admin'),(2497,2017,'항공운항학과','학부모',280000,'','admin'),(2498,2017,'항공운항학과','학부모',320000,'','admin'),(2499,2017,'항공운항학과','학부모',320000,'','admin'),(2500,2017,'항공운항학과','학부모',160000,'','admin'),(2501,2017,'항공운항학과','학부모',160000,'','admin'),(2502,2017,'항공운항학과','학부모',240000,'','admin'),(2503,2017,'항공운항학과','학부모',140000,'','admin'),(2504,2017,'신소재공학전공','교원',150000,'','admin'),(2505,2017,'자동차공학전공','교원',50000,'','admin'),(2506,2017,'항공운항학과','학부모',160000,'','admin'),(2507,2017,'항공운항학과','학부모',360000,'','admin'),(2508,2017,'항공운항학과','학부모',360000,'','admin'),(2509,2017,'항공운항학과','학부모',160000,'','admin');
/*!40000 ALTER TABLE `발전기금조성액상세자료` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-02-27 11:55:05
